bracino/bracino/firmware/node-bbu/sdkconfig.defaults
# Waveshare ESP32-C3-ZERO (4 MB flash, native USB-JTAG/serial)
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Bench only (remove before field image): task-WDT timeouts panic so we get
# a REAL backtrace. The TWDT's own register dumps on this board come out
# corrupted (zeroed MSTATUS/MTVEC, missing backtrace) — see issue 012
# notes 2026-09-02. A panic routes through the proper panic handler.
CONFIG_ESP_TASK_WDT_PANIC=y
